WEBSERVICE/XML_INCLUI_BOLETO_EXEMPLO.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ext="http://caixa.gov.br/sibar/manutencao_cobranca_bancaria/boleto/externo" xmlns:sib="http://caixa.gov.br/sibar">    <soapenv:Header/>    <soapenv:Body>       <ext:SERVICO_ENTRADA>          <sib:HEADER>             <VERSAO>1.0</VERSAO>             <AUTENTICACAO>FTGcCGGC/5mljUAvhPDOv3OaGbN1OE822PJtv6nr1yI=</AUTENTICACAO>             <USUARIO_SERVICO>SGCBS02P</USUARIO_SERVICO>             <OPERACAO>INCLUI_BOLETO</OPERACAO>             <SISTEMA_ORIGEM>SIGCB</SISTEMA_ORIGEM>             <UNIDADE>1679</UNIDADE>             <DATA_HORA>20170503102800</DATA_HORA>          </sib:HEADER>          <DADOS>             <INCLUI_BOLETO>                <CODIGO_BENEFICIARIO>0806248</CODIGO_BENEFICIARIO>                <TITULO>                   <NOSSO_NUMERO>0</NOSSO_NUMERO>                   <NUMERO_DOCUMENTO>TESTE001</NUMERO_DOCUMENTO>                   <DATA_VENCIMENTO>2018-07-07</DATA_VENCIMENTO>                   <VALOR>1000.00</VALOR>                   <TIPO_ESPECIE>99</TIPO_ESPECIE>                   <FLAG_ACEITE>S</FLAG_ACEITE>                   <DATA_EMISSAO>2018-04-25</DATA_EMISSAO>                   <JUROS_MORA>                      <TIPO>TAXA_MENSAL</TIPO>                      <VALOR>2.00</VALOR>                   </JUROS_MORA>                   <VALOR_ABATIMENTO>100.00</VALOR_ABATIMENTO>                   <POS_VENCIMENTO>                      <ACAO>DEVOLVER</ACAO>                      <NUMERO_DIAS>999</NUMERO_DIAS>                   </POS_VENCIMENTO>                   <CODIGO_MOEDA>9</CODIGO_MOEDA>                   <PAGADOR>                      <CPF>01297050126</CPF>                      <NOME>TESTE PAGADOR 001</NOME>                      <ENDERECO>                         <LOGRADOURO>SAUS QUADRA 03</LOGRADOURO>                         <BAIRRO>BRASILIA</BAIRRO>                         <CIDADE>BRASILIA</CIDADE>                         <UF>DF</UF>                         <CEP>70070030</CEP>                      </ENDERECO>                   </PAGADOR>                   <MULTA>                      <DATA>2018-07-08</DATA>                      <VALOR>20.00</VALOR>                   </MULTA>                   <DESCONTOS>                      <!--1 to 3 repetitions:-->                      <DESCONTO>                         <DATA>2018-06-29</DATA>                         <!--You have a CHOICE of the next 2 items at this level-->                         <PERCENTUAL>10.00</PERCENTUAL>                      </DESCONTO>                      <DESCONTO>                         <DATA>2018-07-02</DATA>                         <!--You have a CHOICE of the next 2 items at this level-->                         <PERCENTUAL>5.00</PERCENTUAL>                      </DESCONTO>                      <DESCONTO>                         <DATA>2018-07-05</DATA>                         <!--You have a CHOICE of the next 2 items at this level-->                         <PERCENTUAL>3.00</PERCENTUAL>                      </DESCONTO>                   </DESCONTOS>                   <FICHA_COMPENSACAO>                      <MENSAGENS>                         <MENSAGEM>TESTE DE INCLUSAO WEBSERVICE 1</MENSAGEM>                         <MENSAGEM>TESTE DE INCLUSAO WEBSERVICE 2</MENSAGEM>                      </MENSAGENS>                   </FICHA_COMPENSACAO>                   <RECIBO_PAGADOR>                      <MENSAGENS>                         <MENSAGEM>TESTE DE INCLUSAO WS MSG PAG 1</MENSAGEM>                         <MENSAGEM>TESTE DE INCLUSAO WS MSG PAG 2</MENSAGEM>                         <MENSAGEM>TESTE DE INCLUSAO WS MSG PAG 3</MENSAGEM>                         <MENSAGEM>TESTE DE INCLUSAO WS MSG PAG 4</MENSAGEM>                      </MENSAGENS>                   </RECIBO_PAGADOR>                   <PAGAMENTO>                      <QUANTIDADE_PERMITIDA>1</QUANTIDADE_PERMITIDA>                      <TIPO>ACEITA_VALORES_ENTRE_MINIMO_MAXIMO</TIPO>                      <VALOR_MINIMO>500.00</VALOR_MINIMO>                      <VALOR_MAXIMO>1500.00</VALOR_MAXIMO>                   </PAGAMENTO>                </TITULO>             </INCLUI_BOLETO>          </DADOS>       </ext:SERVICO_ENTRADA>    </soapenv:Body> </soapenv:Envelope>